Repository: gamalbadawy/CELINEwebsite
Catalog: CELINEwebsite/Resources/Views/Home/Index.*.resx
Languages: ar

source: Agile Approach
ar: منهج مرن قابل للتكيّف

source: AI cloud solutions, scalable systems for growth
ar: حلول ذكاء اصطناعي سحابية مصممة لأنظمة قابلة للتوسع و النمو

source: At Celine, we craft custom software solutions, leveraging cutting-edge technology to transform your ideas into powerful digital experiences
ar: في شركةCELINE ، نطور برمجيات خاصة بك، باستخدام تكنولوجيا متطورة لتحويل رؤيتك إلى واقع رقمي متميز

source: Bespoke Development
ar: التطوير حسب الطلب

source: Celine Innovation Tech Solutions specializes in bespoke development, offering end-to-end support with a focus on agility, quality, and client satisfaction
ar: تتخصص CELINE للإبتكار و حلول التكنولوجيا" فى التطوير المخصص، مع تقديم دعم شامل يركز على المرونة والجودة ورضا العملاء

source: Custom-built software designed to enhance your organization’s efficiency
ar: برامج إلكترونية مصممة خصيصًا لتعزيز كفاءة مؤسستك

source: Discover how our digital solutions can make a difference in your project
ar: كتشف كيف يمكن لحلولنا الإلكترونية أن تُحدث فرقًا في مشروعك

source: Don’t let your ideas stay trapped on paper—turn them into effective software with CELINE
ar: لا تترك أفكارك حبيسة الأوراق، حوّلها إلى برامج فعالة مع CELINE

source: End-to-End Support
ar: دعم شامل

source: Every client deserves a tailored system, and that’s exactly what we deliver
ar: كل عميل يستحق نظامًا مخصصًا، وهذا بالضبط ما نقدمه لك

source: Explore
ar: إكتشف

source: From ideas to execution: We provide the best technological solutions
ar: من الأفكار إلى التطبيق: نقدم لك الحلول التكنولوجية الأفضل

source: Innovate
ar: إبتكر

source: Innovate with us
ar: إبتكر معنا

source: Our technology is designed to keep you ahead of the competition
ar: تكنولوجيا مُصممة لتبقيك دائمًا فى الصدارة

source: Projects Completed
ar: المشاريع المكتملة

source: Share your idea
ar: شاركنا فكرتك

source: Smart solutions to accelerate your business growth in the digital world
ar: حلول ذكية لتسريع نمو أعمالك في العالم الرقمى

source: Software built on the latest technologies, meeting all your requirements with high precision
ar: برامج مبنية على أحدث التقنيات، تلبي جميع متطلباتك بدقة عالية

source: Team Members
ar: فريق العمل

source: We design customized software tailored to your business needs with precision and professionalism
ar: نصمم برامج مخصصة تناسب احتياجات عملك بدقة واحترافية

source: We develop tech solutions that simplify your operations and boost productivity
ar: نطور حلولًا تقنية تُبسِّط عملياتك وتُعزِّز إنتاجيتك

source: We don’t offer generic services—we create a unique digital experience for you
ar: نحن لا نقدم خدمات تقليدية، بل نصنع لك تجربة رقمية فريدة

source: Celine Innovation Tech Solutions transformed our ideas into reality with their bespoke software development. Their agile approach and quality-driven service exceeded our expectations
ar: حولت CELINE أفكارنا إلى واقع من خلال برامج مُصممة خصيصاً لنا. طريقة عملهم المرنة وخدمتهم عالية الجودة فاقت توقعاتنا

source: Mariah Asher
ar: ماريا آشر

source: Cutting Edge Tech
ar: تكنولوجيا فائقة التطور

source: Innovative Solutions
ar: حلول مبتكرة

source: Celine Innovative Tech Solutions for Your Business
ar: Celine حلول تكنولوجية مبتكرة لأعمالك

source: Web and mobile apps, ERP systems crafted
ar: تصميم تطبيقات الويب و الجوال و أنظمة إدارة الموارد ERP systems

source: Discover
ar: إكتشف المزيد

source: Full Support
ar: دعم شامل

source: Full-Cycle Technical Support - Always On
ar: دعم فنى شامل على مدار الساعة

source: Transforming Ideas into Reality
ar: نحول الأفكار إلى واقع ملموس

source: Leverage our technical mastery to bring your most ambitious projects to life with precision and creativity
ar: استفد من براعتنا الفنية لتحويل مشاريعك الطموحة إلى حقيقة بدقة و إبداع

source: Seamless Integration, Exceptional Performance
ar: تكامل سلس و آداء استثنائى

source: We ensure smooth implementation of our systems with zero downtime, maximizing your operational productivity from day one
ar: نضمن تنفيذًا سلسًا لأنظمتنا دون أي توقف، لتحقيق أقصى إنتاجية تشغيلية من اليوم الأول

source: Future-Proof Solutions for Sustainable Growth
ar: حلول مستدامة تنمو مع مستقبلك

source: Our scalable systems evolve with your business, ensuring long-term success in a dynamic market
ar: أنظمتنا القابلة للتوسع تتطور مع نمو عملك، لضمان نجاح طويل الأمد فى سوق متغير
